Revit 2026 API

# FamilyParameterIsDeterminedByFormula Property

---

Indicates if the parameter is determined by formula.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsDeterminedByFormula { get; }
```
```vb
Public ReadOnly Property IsDeterminedByFormula As Boolean
	Get
```
```cpp
public:
property bool IsDeterminedByFormula {
	bool get ();
}
```
```fsharp
member IsDeterminedByFormula : bool with get
```

#### Property Value

Boolean

The parameter is read only if it is determined by formula.

#### Reference

FamilyParameter Class

Autodesk.Revit.DB Namespace